site.org
#+STARTUP: logdone
#+hugo_base_dir: .
#+title: blog title

* DONE About
  CLOSED: [2020-02-06 Thu 11:30]
:properties:
:export_hugo_section: about
:export_file_name: _index
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :aliases '("urn-uuid-daefb9ac-ec67-4393-a371-db621035bbef/")
:end:

Hi, this is Morgan.

Github: [[https://github.com/MHBauer/][@MHBauer]]
Twitter: [[https://twitter.com/ibmhb][@ibmhb]]
Linkedin: [[https://www.linkedin.com/in/morganbauer/][@morganbauer]]

A long time ago, I had a site at https://www.cise.ufl.edu/~mhb/, but it's gone now.
Some of it is [[https://web.archive.org/web/*/https://www.cise.ufl.edu/~mhb//*][still visible]] in the internet archive.

I've got a [[/resume2.pdf][resume]] but it's probably better to check linkedin for more complete information.

** Purpose

A place to write down some stuff that has meaning to me.
Experiences had.
Production and consumption.
Thoughts.


** Equipment

 - logitech c922
 - logitech c920
 - logitech h650e
 
