content/about/_index.md
+++
title = "About"
date = 2020-02-06T11:30:00-08:00
draft = false
aliases = ["urn-uuid-daefb9ac-ec67-4393-a371-db621035bbef/"]
+++

Hi, this is Morgan.

Github: [@MHBauer](https://github.com/MHBauer/)
Twitter: [@ibmhb](https://twitter.com/ibmhb)
Linkedin: [@morganbauer](https://www.linkedin.com/in/morganbauer/)

A long time ago, I had a site at <https://www.cise.ufl.edu/~mhb/>, but it's gone now.
Some of it is [still visible](https://web.archive.org/web/*/https://www.cise.ufl.edu/~mhb//*) in the internet archive.

I've got a [resume](/resume2.pdf) but it's probably better to check linkedin for more complete information.


## Purpose {#purpose}

A place to write down some stuff that has meaning to me.
Experiences had.
Production and consumption.
Thoughts.


## Equipment {#equipment}

-   logitech c922
-   logitech c920
-   logitech h650e